# Задание 2.
# Напишите скрипт для сортировки списка кортежей по второму элементу с помощью Lambda.

lt = [("abc", 123), ("def", 125), ("cde", 124), ("bcd", 120)]
print(sorted(lt, key=lambda x: x[0]))