# Задание 3.
# Напишите скрипт для извлечения года, месяца, даты и времени с помощью Lambda.
# В реализации исполузуйте модуль datetime.

from datetime import datetime, date, time
dt = datetime.today()
print(dt)