# Написать генератор, возвращающий  последние n строк из текстового файла, при этом не загружая в память весь файл.
def get_last_strings(f):
    print(f.)


with open("textfile.txt", "r", encoding='utf8') as f:
    for _ in range(5):
        print(next(get_last_strings(f)))